app/controllers/api/contracts_controller.rb

SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
      render json: Contract.find(params[:id]).to_json

SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def medias
      contract = Contract.find(params[:id])