app/controllers/api/inputs_controller.rb

    def fetch_inputs
      provider = Provider.find(params[:provider_id])
      render json: provider.inputs.select(:id, :name).to_json
---
SELECT  "providers".* FROM "providers" WHERE "providers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "inputs"."id", "inputs"."name" FROM "inputs" INNER JOIN "provider_inputs" ON "inputs"."id" = "provider_inputs"."input_id" WHERE "provider_inputs"."provider_id" = $1  [["provider_id", 3]]