app/views/purchase_orders/_form.html.erb

                  <span v-show="isValidField('abbreviation')" class='required-field'>*</span>
                  <%= f.collection_select(
                    :user_id,
                    Provider.all,
                    :id,
                    :name,
                    { include_blank: true },
                    {
                      class: 'form-control input-sm',
                      "v-validate"=>"'required'",
                      "@change" => "fetchInputs",
                      "v-model" => "provider"
                    }
                  )
---
SELECT "providers".* FROM "providers"