app/views/contracts/_form.html.erb

            <label for="contract_contract_type_id">Tipo de Contrato</label>
            <%=
              f.collection_select(
                :contract_type_id,
                ContractType.all,
                :id,
                :name,
                {include_blank: true},
                {
                  class: 'form-control select2 input-sm'
                }
              )
---
SELECT "contract_types".* FROM "contract_types"

            <label for="contract_contract_type_id">Tipo de Contrato</label>
            <%=
              f.collection_select(
                :work_id,
                Work.all,
                :id,
                :name,
                {include_blank: true},
                {
                  class: 'form-control select2 input-sm'
                }
              )
---
SELECT "works".* FROM "works"

            <label for="contract_contractor_id">Contratista</label>
            <%=
              f.collection_select(
                :contractor_id,
                Contractor.all,
                :id,
                :name,
                { include_blank: true },
                {
                  'data-fieldname' => 'contractor_id',
                  class: 'form-control select2 input-sm select2',
                  "v-model" => "contractor_id"
                }
              )
---
SELECT "contractors".* FROM "contractors"