app/views/works/_form.html.erb

                  <span v-show="isValidField('abbreviation')" class='required-field'>*</span>
                   <%= f.collection_select(
                    :work_type_id,
                    WorkType.all,
                    :id,
                    :name,
                    { include_blank: true },
                    {
                      class: 'form-control input-sm',
                      "v-validate"=>"'required'",
                    }
                  )
---
SELECT "work_types".* FROM "work_types"