app/views/inputs/_form.html.erb

                  <span v-show="isValidField('abbreviation')" class='required-field'>*</span>
                   <%= f.collection_select(
                    :provider_ids,
                    Provider.all,
                    :id,
                    :name,
                    { include_blank: true },
                    {
                      class: 'form-control select2 input-sm',
                      multiple: true,
                      "v-validate"=>"'required'",
                    }
                  )
---
SELECT "providers".id FROM "providers" INNER JOIN "provider_inputs" ON "providers"."id" = "provider_inputs"."provider_id" WHERE "provider_inputs"."input_id" = $1  [["input_id", 5]]