app/views/contractors/_form.html.erb

                <span v-show="isValidField('contractor_type_id')" class='required-field'>*</span>
                <%=
                  f.collection_select(
                    :contractor_type_id,
                    ContractorType.all,
                    :id,
                    :name,
                    { include_blank: true },
                    {
                      class: 'form-control input-sm',
                      "v-validate"=>"'required'",
                       "v-model" => "contractor_type_id"
                    }
                  )
---
SELECT "contractor_types".* FROM "contractor_types"