app/views/payments/_form.html.erb

SELECT "contracts".* FROM "contracts"
---
            <span v-show="isValidField('contract')" class='required-field'>*</span>
            <%=
              f.collection_select(
                :contract_id,
                Contract.all,
                :id,
                :process_number,
                {include_blank: true},
                {
                  class: 'form-control select2 input-sm',
                  disabled: !@payment.new_record?,
                  "v-validate"=>"'required'"
                }
              )