app/controllers/contractors_controller.rb

  def index
    unless params[:query]
      @contractors = Contractor.page(params[:page]).order(:name)
---
SELECT  "contractors".* FROM "contractors" ORDER BY "contractors"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "contractors" LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]

  def create
    @contractor = Contractor.new(contractor_params)
    authorize @contractor

    # TODO: Refactor
    if @contractor.contractor_type_id == 2
      @contractor.legal_representant_name = @contractor.name
      @contractor.legal_representant_document_number = @contractor.document_number
      @contractor.legal_representant_document_type = @contractor.document_type
    end

    respond_to do |format|
      if @contractor.save
---
INSERT INTO "contractors" ("name", "document_number", "document_type", "legal_representant_name", "legal_representant_document_number", "legal_representant_document_type", "contractor_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"