app/controllers/contractor_types_controller.rb

SELECT "contractor_types".* FROM "contractor_types"
---
  def index
    @contractor_types = ContractorType.all

INSERT INTO "contractor_types" ("abbreviation", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["abbreviation", "PN"], ["name", "A GUY"], ["created_at", "2019-06-12 09:27:57.973420"], ["updated_at", "2019-06-12 09:27:57.973420"]]
---
  def create
    @contractor_type = ContractorType.new(contractor_type_params)
    authorize @contractor_type

    respond_to do |format|
      if @contractor_type.save