app/controllers/contract_types_controller.rb

SELECT "contract_types".* FROM "contract_types"
---
  def index
    @contract_types = ContractType.all