app/controllers/contracts_controller.rb

SELECT  "contracts".* FROM "contracts" ORDER BY "contracts"."process_number" DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "contracts" LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    unless session[:contracts_hash].blank?
      @contracts = Contract.contracts_search(session[:contracts_hash]).includes(:contractor, :budgets).order(process_number: :desc).page(params[:page])

INSERT INTO "contracts" ("contract_number", "process_number", "contractual_object", "start_date", "end_date", "value", "state", "interventor_contractor_id", "supervisor_contractor_id", "contractor_id", "contract_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @contract = ::Contract.new(contract_params)
    authorize @contract

    respond_to do |format|
      if @contract.save