app/controllers/inputs_controller.rb

SELECT "inputs".* FROM "inputs"
---
  def index
    @inputs = Input.all

INSERT INTO "inputs" ("name", "abbrevation", "input_type", "metrics", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create

    @input = Input.new(input_params)
    respond_to do |format|
      if @input.save

UPDATE "inputs" SET "abbrevation" = $1, "input_type" = $2, "description" = $3, "updated_at" = $4 WHERE "inputs"."id" = $5  [["abbrevation", "bld"], ["input_type", "MT"], ["description", "Baldosa"], ["updated_at", "2019-06-12 09:21:44.666163"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @input.update(input_params)

SELECT  "inputs".* FROM "inputs" WHERE "inputs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_input
    @input = Input.find(params[:id])