app/controllers/inventories_controller.rb

  def index
    @inventories = @work.inventories.all
---
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."work_id" = $1 ORDER BY "inventories"."id" ASC LIMIT $2  [["work_id", 1], ["LIMIT", 1]]

  def create
    @inventory = @work.inventories.new(inventory_params)
    respond_to do |format|
      if @inventory.save
---
INSERT INTO "inventories" ("code", "state", "review_period", "created_at", "updated_at", "work_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["code", "123"], ["state", "HA"], ["review_period", "2019-07-07"], ["created_at", "2019-06-12 07:49:35.985791"], ["updated_at", "2019-06-12 07:49:35.985791"], ["work_id", 1]]

  def update
    respond_to do |format|
      if @inventory.update(inventory_params)
---
UPDATE "inventories" SET "state" = $1, "updated_at" = $2 WHERE "inventories"."id" = $3  [["state", "FS"], ["updated_at", "2019-06-12 07:52:55.050782"], ["id", 1]]

  def set_work
    @work = Work.find(params[:work_id])
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_inventory
    @inventory = Inventory.find(params[:id])
---
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]