app/controllers/payments_controller.rb

SELECT  "payments".* FROM "payments" ORDER BY "payments"."date" DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "payments" LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    unless session[:payments_hash].blank?
      @payments = Payment.payments_search(session[:payments_hash]).order(:date).page(params[:page])

INSERT INTO "payments" ("code", "observations", "payment_type", "vat", "date", "value", "base_value", "vat_value", "contract_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @payment = Payment.new(payment_params)
    authorize @payment
    respond_to do |format|
      if @payment.save(context: :payment_setup)

SELECT  "payments".* FROM "payments" WHERE "payments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_payment
    @payment = Payment.find(params[:id])