app/controllers/providers_controller.rb

  def index
    @providers = Provider.all
---
SELECT "providers".* FROM "providers"

  def create
    @provider = Provider.new(provider_params)
    respond_to do |format|
      if @provider.save
---
INSERT INTO "providers" ("name", "number", "indentifier", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "El proveedor 2"], ["number", "123123"], ["indentifier", "12er45"], ["created_at", "2019-06-12 05:59:40.852186"], ["updated_at", "2019-06-12 05:59:40.852186"]]

  def update
    respond_to do |format|
      if @provider.update(provider_params)
---
UPDATE "providers" SET "name" = $1, "number" = $2, "updated_at" = $3 WHERE "providers"."id" = $4  [["name", "qweqweq"], ["number", "123123"], ["updated_at", "2019-06-12 04:46:45.568824"], ["id", 1]]

  def destroy
    @provider.destroy
---
DELETE FROM "providers" WHERE "providers"."id" = $1  [["id", 2]]

  def set_provider
    @provider = Provider.find(params[:id])
---
SELECT  "providers".* FROM "providers" WHERE "providers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]