app/controllers/purchase_orders_controller.rb

INSERT INTO "purchase_orders" ("order_number", "invoice_number", "base_value", "vat_value", "vat_percentage", "inventory_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @purchase_order = @inventory.purchase_orders.new(purchase_order_params)
    respond_to do |format|
      if @purchase_order.save

SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_work
    @work = Work.find(params[:work_id])

SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_inventory
    set_work
    @inventory = Inventory.find(params[:inventory_id])