app/controllers/work_types_controller.rb

SELECT "work_types".* FROM "work_types"
---
  def index
    @work_types = WorkType.all

SELECT  "work_types".* FROM "work_types" WHERE "work_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_work_type
    @work_type = WorkType.find(params[:id])