app/controllers/works_controller.rb

INSERT INTO "works" ("number", "description", "budget", "work_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["number", "1"], ["description", "We building shit"], ["budget", "10000000000.0"], ["work_type_id", 1], ["created_at", "2019-06-12 07:06:20.927203"], ["updated_at", "2019-06-12 07:06:20.927203"]]
---
  def create
    @work = Work.new(work_params)
    respond_to do |format|
      if @work.save